-- НУЖНО СОЗДАТЬ ТАБЛИЦЫ!
-- Данные после таблиц, можно ориентироваться так же по ним.
drop table if exists seat;
drop table if exists ticket;
drop table if exists flight;
drop table if exists aircraft;
drop table if exists airport;

#Таблица аэропорт
CREATE TABLE airport
(
    -- первичный ключ, уникальный, текст
    code ,

    -- текст, обязательное поле
    country ,

    -- текст, обязательное поле
    city
);

#Таблица самолеты
CREATE TABLE aircraft
(
    -- число первичный ключ
    id ,

    -- текст, обязательное поле
    model
);

#Таблица места в самолете
CREATE TABLE seat
(
    -- число, первичный ключ, ссылка на id в aircraft
    aircraft_id ,

    -- текст, обязательное поле, первичный ключ
    seat_number ,
);

CREATE UNIQUE INDEX unique_?_idx ON ();

#Таблица маршрутов
CREATE TABLE flight
(
    -- число, первичный ключ
    id ,

    -- текст, обязательное поле
    flight_number ,

    -- TIMESTAMP, обязательное поле
    departure_date ,

    -- текст, ссылка на code в airport, обязательное поле
    departure_airport_code ,

    -- TIMESTAMP, обязательное поле
    arrival_date ,

    -- текст, ссылка на code в airport, обязательное поле
    arrival_airport_code ,

    -- число, ссылка на id в aircraft
    aircraft_id ,

    -- текст, обязательное поле
    -- может содержать только ARRIVED, DEPARTED, CANCELLED, SCHEDULED
    status,

);

#Таблица билетов
CREATE TABLE ticket
(
    -- число, первичный ключ
    id ,

    -- текст, обязательное поле
    passport_number ,

    -- текст, обязательное поле
    passenger_name  ,

    -- число, ссылка на id во flight
    flight_id  ,

    -- текст, обязательное поле
    seat_number ,

    -- нумерик, 2 зн.после запятой, обязательный
    cost ,


);














-- Заполнение таблиц
insert into airport (code, country, city)
values ('MSK', 'Россия', 'Москва'),
       ('LDN', 'Англия', 'Лондон'),
       ('LED', 'Россия', 'Санкт-Петербург'),
       ('BSL', 'Испания', 'Барселона');

insert into aircraft (model)
values ('Боинг 777-300'),
       ('Боинг 737-300'),
       ('Аэробус A320-200'),
       ('Суперджет-100');

INSERT INTO seat (aircraft_id, seat_number)
SELECT a.id, s.seat_number
FROM aircraft a
         CROSS JOIN (SELECT 'A1' AS seat_number
                     UNION ALL
                     SELECT 'A2'
                     UNION ALL
                     SELECT 'B1'
                     UNION ALL
                     SELECT 'B2'
                     UNION ALL
                     SELECT 'C1'
                     UNION ALL
                     SELECT 'C2'
                     UNION ALL
                     SELECT 'D1'
                     UNION ALL
                     SELECT 'D2') AS s;

insert into flight (flight_number, departure_date, departure_airport_code, arrival_date, arrival_airport_code,
                    aircraft_id,
                    status)
values ('MS3201', '2020-06-14T14:30', 'MSK', '2020-06-14T18:07', 'LDN', 1, 'ARRIVED'),
       ('MS3201', '2020-06-16T09:15', 'LDN', '2020-06-16T13:00', 'MSK', 1, 'ARRIVED'),
       ('BC2801', '2020-07-28T23:25', 'MSK', '2020-07-29T02:43', 'LDN', 2, 'ARRIVED'),
       ('BC2801', '2020-08-01T11:00', 'LDN', '2020-08-01T14:15', 'MSK', 2, 'DEPARTED'),
       ('TR3103', '2020-05-03T13:10', 'LED', '2020-05-03T18:38', 'BSL', 3, 'ARRIVED'),
       ('TR3103', '2020-05-10T07:15', 'BSL', '2020-05-10T012:44', 'LED', 3, 'CANCELLED'),
       ('CV9827', '2020-09-09T18:00', 'MSK', '2020-09-09T19:15', 'LED', 4, 'SCHEDULED'),
       ('CV9827', '2020-09-19T08:55', 'LED', '2020-09-19T10:05', 'MSK', 4, 'SCHEDULED'),
       ('QS8712', '2020-12-18T03:35', 'MSK', '2020-12-18T06:46', 'LDN', 2, 'ARRIVED');

insert into ticket (passport_number, passenger_name, flight_id, seat_number, cost)
values ('AA33Q24', 'Иван Иванов', 1, 'A1', 200),
       ('NN789B', 'Петр Петров', 1, 'B1', 180),
       ('JD3217', 'Светлана Тарабукина', 1, 'B2', 175),
       ('QW76NB', 'Андрей Андреев', 1, 'C2', 175),
       ('POQ234', 'Иван Андропов', 1, 'D1', 160),
       ('898123', 'Дмитрий Губцов', 1, 'A2', 198),
       ('555321', 'Екатерина Семеновна', 2, 'A1', 250),
       ('QO23OO', 'Иван Базиликов', 2, 'B2', 225),
       ('9883IO', 'Иван Андропов', 2, 'C1', 217),
       ('1F9UI2', 'Андрей Буйнов', 2, 'C2', 227),
       ('JD3217', 'Светлана Тарабукина', 2, 'D2', 277),
       ('98KL66', 'Артур Солькин', 3, 'А1', 300),
       ('JJBH54', 'Эдуард Тарасов', 3, 'А2', 285),
       ('77ZZVV', 'Максим Рожной', 3, 'B1', 99),
       ('DLSSSS', 'Катерина Чайкина', 3, 'B2', 199),
       ('XP91AA', 'Глеб Серпухов', 3, 'A3', 230),
       ('QR5571', 'Савелий Корнилов', 3, 'B4', 180),
       ('MTL902', 'Мария Охотникова', 3, 'D3', 224),
       ('RK44ZE', 'Ярослав Леванов', 4, 'C1', 129),
       ('HG9921', 'Мария Фадеева', 4, 'A4', 152),
       ('PR4421', 'Герман Дубровин', 4, 'B2', 140),
       ('TLK129', 'Вероника Нечаева', 4, 'C4', 140),
       ('FS12DD', 'Иван Бутримов', 4, 'A2', 109),
       ('ZXQ914', 'Святослав Молчан', 5, 'D1', 170),
       ('NMB771', 'Ксения Архипова', 5, 'A3', 185),
       ('VSA912', 'Дарья Касаткина', 5, 'C2', 204),
       ('BTR672', 'Арам Багдасарян', 5, 'B3', 189),
       ('POV551', 'Сергей Блинов', 6, 'D3', 204),
       ('KKL178', 'Сергей Ямпольский', 6, 'A4', 214),
       ('JH55A2', 'Даниил Штырёв', 6, 'A1', 176),
       ('ZA47T2', 'Семён Орлов', 6, 'B4', 135),
       ('FF3623', 'Алёна Прудникова', 6, 'C3', 155),
       ('VRM612', 'Олег Веретенников', 6, 'D4', 125),
       ('QWZ771', 'Иван Седов', 7, 'B1', 69),
       ('LM92XA', 'Диана Светличная', 7, 'A3', 58),
       ('PU812D', 'Иван Грознов', 7, 'C1', 65),
       ('PA91K2', 'Мария Курбатова', 7, 'B4', 65),
       ('9AU521', 'Илья Меркушев', 7, 'D3', 73),
       ('LSQ512', 'Лора Дашкова', 7, 'A1', 66),
       ('QP891B', 'Степан Журавлёв', 7, 'D2', 80),
       ('RS56NB', 'Сергей Балакин', 8, 'A4', 100),
       ('PL87Q2', 'Валерия Савина', 8, 'B2', 89),
       ('AAX772', 'Павел Юсупов', 8, 'C3', 79),
       ('UQZ882', 'Алёна Крылова', 8, 'C1', 77),
       ('BM992D', 'Алёна Кривошеева', 8, 'D4', 94),
       ('BTX217', 'Эмиль Харченко', 8, 'A2', 81),
       ('JD92L7', 'Жанна Агафонова', 9, 'C4', 222),
       ('SS901D', 'Тимофей Козлов', 9, 'B2', 198),
       ('SS988F', 'Лев Туманов', 9, 'A3', 243),
       ('SS911A', 'Радимир Кожевников', 9, 'D3', 251),
       ('AA91G24', 'Илья Фомин', 9, 'A1', 135),
       ('NMN512', 'Алёна Лещёва', 9, 'C2', 217),
       ('NN772B', 'Кирилл Сухарев', 9, 'B1', 189),
       ('923951Q', 'Елена Маринкина', 9, 'D1', 234);