-- НУЖНО СОЗДАТЬ ТАБЛИЦЫ!
-- Данные после таблиц, можно ориентироваться так же по ним.
drop table if exists seat;
drop table if exists ticket;
drop table if exists flight;
drop table if exists aircraft;
drop table if exists airport;

#Таблица аэропорт
CREATE TABLE airport
(
    -- первичный ключ, уникальный, текст
    code ,

    -- текст, обязательное поле
    country ,

    -- текст, обязательное поле
    city
);

#Таблица самолеты
CREATE TABLE aircraft
(
    -- число первичный ключ
    id ,

    -- текст, обязательное поле
    model
);

#Таблица места в самолете
CREATE TABLE seat
(
    -- число, первичный ключ, ссылка на id в aircraft
    aircraft_id ,

    -- текст, обязательное поле, первичный ключ
    seat_number ,
);

CREATE UNIQUE INDEX unique_?_idx ON ();

#Таблица маршрутов
CREATE TABLE flight
(
    -- число, первичный ключ
    id ,

    -- текст, обязательное поле
    flight_number ,

    -- TIMESTAMP, обязательное поле
    departure_date ,

    -- текст, ссылка на code в airport, обязательное поле
    departure_airport_code ,

    -- TIMESTAMP, обязательное поле
    arrival_date ,

    -- текст, ссылка на code в airport, обязательное поле
    arrival_airport_code ,

    -- число, ссылка на id в aircraft
    aircraft_id ,

    -- текст, обязательное поле
    -- может содержать только ARRIVED, DEPARTED, CANCELLED, SCHEDULED
    status,

);

#Таблица билетов
CREATE TABLE ticket
(
    -- число, первичный ключ
    id ,

    -- текст, обязательное поле
    passport_number ,

    -- текст, обязательное поле
    passenger_name  ,

    -- число, ссылка на id во flight
    flight_id  ,

    -- текст, обязательное поле
    seat_number ,

    -- нумерик, 2 зн.после запятой, обязательный
    cost ,


);














-- Заполнение таблиц
insert into airport (code, country, city)
values ('MSK', 'Россия', 'Москва'),
       ('LDN', 'Англия', 'Лондон'),
       ('LED', 'Россия', 'Санкт-Петербург'),
       ('BSL', 'Испания', 'Барселона');

insert into aircraft (model)
values ('Боинг 777-300'),
       ('Боинг 737-300'),
       ('Аэробус A320-200'),
       ('Суперджет-100');

INSERT INTO seat (aircraft_id, seat_number)
SELECT a.id, s.seat_number
FROM aircraft a
         CROSS JOIN (SELECT 'A1' AS seat_number
                     UNION ALL
                     SELECT 'A2'
                     UNION ALL
                     SELECT 'B1'
                     UNION ALL
                     SELECT 'B2'
                     UNION ALL
                     SELECT 'C1'
                     UNION ALL
                     SELECT 'C2'
                     UNION ALL
                     SELECT 'D1'
                     UNION ALL
                     SELECT 'D2') AS s;

insert into flight (flight_number, departure_date, departure_airport_code, arrival_date, arrival_airport_code,
                    aircraft_id,
                    status)
values ('MS3201', '2020-06-14T14:30', 'MSK', '2020-06-14T18:07', 'LDN', 1, 'ARRIVED'),
       ('MS3201', '2020-06-16T09:15', 'LDN', '2020-06-16T13:00', 'MSK', 1, 'ARRIVED'),
       ('BC2801', '2020-07-28T23:25', 'MSK', '2020-07-29T02:43', 'LDN', 2, 'ARRIVED'),
       ('BC2801', '2020-08-01T11:00', 'LDN', '2020-08-01T14:15', 'MSK', 2, 'DEPARTED'),
       ('TR3103', '2020-05-03T13:10', 'LED', '2020-05-03T18:38', 'BSL', 3, 'ARRIVED'),
       ('TR3103', '2020-05-10T07:15', 'BSL', '2020-05-10T012:44', 'LED', 3, 'CANCELLED'),
       ('CV9827', '2020-09-09T18:00', 'MSK', '2020-09-09T19:15', 'LED', 4, 'SCHEDULED'),
       ('CV9827', '2020-09-19T08:55', 'LED', '2020-09-19T10:05', 'MSK', 4, 'SCHEDULED'),
       ('QS8712', '2020-12-18T03:35', 'MSK', '2020-12-18T06:46', 'LDN', 2, 'ARRIVED');

insert into ticket (passport_number, passenger_name, flight_id, seat_number, cost)
values ('AA33Q24', 'Иван Иванов', 1, 'A1', 200),
       ('NN789B', 'Петр Петров', 1, 'B1', 180),
       ('JD3217', 'Светлана Тарабукина', 1, 'B2', 175),
       ('QW76NB', 'Андрей Андреев', 1, 'C2', 175),
       ('POQ234', 'Иван Андропов', 1, 'D1', 160),
       ('898123', 'Дмитрий Губцов', 1, 'A2', 198),
       ('555321', 'Екатерина Семеновна', 2, 'A1', 250),
       ('QO23OO', 'Иван Базиликов', 2, 'B2', 225),
       ('9883IO', 'Иван Андропов', 2, 'C1', 217),
       ('1F9UI2', 'Андрей Буйнов', 2, 'C2', 227),
       -- доделать отсюда
       ('JD3217', 'Светлана Тарабукина', 2, 'D2', 277),
       ('EE2344', 'Дмитрий Трусцов', 3, 'А1', 300),
       ('AS23PP', 'Максим Комсомольцев', 3, 'А2', 285),
       ('322349', 'Эдуард Щеглов', 3, 'B1', 99),
       ('DL123S', 'Игорь Беркутов', 3, 'B2', 199),
       ('MVM111', 'Алексей Щербин', 3, 'C1', 299),
       ('ZZZ111', 'Денис Колобков', 3, 'C2', 230),
       ('234444', 'Иван Старовойтов', 3, 'D1', 180),
       ('LLLL12', 'Людмила Старовойтова', 3, 'D2', 224),
       ('RT34TR', 'Степан Дор', 4, 'A1', 129),
       ('999666', 'Анастасия Шепелева', 4, 'A2', 152),
       ('234444', 'Иван Старовойтов', 4, 'B1', 140),
       ('LLLL12', 'Людмила Старовойтова', 4, 'B2', 140),
       ('LLLL12', 'Роман Дронов', 4, 'D2', 109),
       ('AA33Q24', 'Иван Иванов', 5, 'С2', 170),
       ('NMNBV2', 'Лариса Тельникова', 5, 'С1', 185),
       ('DSA586', 'Лариса Привольная', 5, 'A1', 204),
       ('DSA583', 'Артур Мирный', 5, 'B1', 189),
       ('DSA581', 'Евгений Кудрявцев', 6, 'A1', 204),
       ('EE2344', 'Дмитрий Трусцов', 6, 'A2', 214),
       ('AS23PP', 'Максим Комсомольцев', 6, 'B2', 176),
       ('AA33Q24', 'Иван Иванов', 6, 'B1', 135),
       ('309623', 'Татьяна Крот', 6, 'С1', 155),
       ('319623', 'Юрий Дувинков', 6, 'D1', 125),
       ('322349', 'Эдуард Щеглов', 7, 'A1', 69),
       ('DIOPSL', 'Евгений Безфамильная', 7, 'A2', 58),
       ('DIOPS1', 'Константин Швец', 7, 'D1', 65),
       ('DIOPS2', 'Юлия Швец', 7, 'D2', 65),
       ('1IOPS2', 'Ник Говриленко', 7, 'C2', 73),
       ('999666', 'Анастасия Шепелева', 7, 'B1', 66),
       ('NN789B', 'Петр Петров', 7, 'C1', 80),
       ('QW76NB', 'Андрей Андреев', 8, 'A1', 100),
       ('1QAZD2', 'Лариса Потемнкина', 8, 'A2', 89),
       ('5QAZD2', 'Карл Хмелев', 8, 'B2', 79),
       ('2QAZD2', 'Жанна Хмелева', 8, 'С2', 77),
       ('BMXND1', 'Светлана Хмурая', 8, 'В2', 94),
       ('BMXND2', 'Кирилл Сарычев', 8, 'D1', 81),
       ('JD3217', 'Светлана Тарабукина', 9, 'A2', 222),
       ('SS978D', 'Андрей Желудь', 9, 'A1', 198),
       ('SS968D', 'Дмитрий Воснецов', 9, 'B1', 243),
       ('SS958D', 'Максим Гребцов', 9, 'С1', 251),
       ('AA33Q24', 'Иван Иванов', 9, 'С2', 135),
       ('NMNBV2', 'Лариса Тельникова', 9, 'B2', 217),
       ('NN789B', 'Петр Петров', 9, 'D1', 189),
       ('123951', 'Полина Зверева', 9, 'D2', 234);